742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/xiao ai/frame_process.c
///////////////////////////////////////////////////////////////////////////////////

//LED控制命令的处理
#if 0
void Led_Control_Process(uint8_t led_setval, DevicePara_TypDef *p_device)
{
    if ((led_setval & 0xf0) == 0x40)
    {
        uint8_t color_val;

        if ((led_setval & 0x0f) <= 0x03)
        {
            color_val = led_setval & 0x03;
        }
        else
            color_val = 0x01;
        if (color_val == 0x00)
        {
            if (p_device->MiddleLed_Contorl == 0x10)
            {
                p_device->MiddleLed_Contorl = 0x02;
            }
        }
        else if (p_device->MiddleLed_Contorl == 0x00)
        {
            p_device->MiddleLed_Contorl = 0x01;
            p_device->Led4_CotrolPara = color_val | 0x40;
        }
    }

    else if ((led_setval & 0xf0) == 0x50)
    {
        LED_Clear(1);
        p_device->Led_Mode5DelayCnt = 0;
        p_device->Led_Mode5Volume = led_setval & 0x0f;
        if ((p_device->Led_CotrolPara & 0xf0) != 0x50)
            p_device->Led_LastCotrolPara = p_device->Led_CotrolPara;
        p_device->Led_CotrolPara = led_setval;
    }

    else
    {
        if (p_device->Led_CotrolPara != led_setval)
        {
            LED_Clear(1);
            p_device->Led_CotrolPara = led_setval;
        }
    }
}
#endif

//解出AES
uint8_t SecretKey_Process(DeviceInfo_t *p_deviceInfo)
{
		
	memcpy(&aes_out[2*RsaByte_Size],p_deviceInfo->aes,16);
	memcpy(&aes_out[3*RsaByte_Size],p_deviceInfo->addr_GA,3);

	Rsa_Decode(aes_out);

	memcpy(LANGroup_Addr, deviceInfo.addr_GA, 3); //移入群组地址到群组地址BUF
	key_expansion(aes_out, aes_w);

	Secret_KeyOk_Flag = 1;


	Get_WireLessChannel(Wireless_Channel);
#ifdef Use_Rx_Hop
	Wireless_Init(); //Initial Wireless，开始初始化无线
#endif
	Si4438_Receive_Start(Wireless_Channel[0]); //Start Receive

    return 0;
}

uint8_t MACRead_Process(uint8_t *p_buf)
{
    Eeprom_Read(MAC_EAddr, (uint16_t *)Local_MAC_Addr, MAC_Data_Len + 5); //

    if (0 == FrameData_Detect(Local_MAC_Addr, MAC_Data_Len + 5))
    {
        memmove(&p_buf[Region_DataValNumber], &Local_MAC_Addr[3], MAC_Data_Len);
        p_buf[Region_DataLenNumber] = 12;
        return 1;
    }
    else
        return 0;
}

void Local_CmdFrame_Process(uint8_t *p_source, HKFrame_TypDef *p_framebuf, DevicePara_TypDef *p_device)
{
    uint8_t reply_flag = 0;
    uint8_t send_len;
    uint8_t *p = p_framebuf->FrameProcess_Buf;
    uint8_t ask = 0;

    if (memcmp(&p_source[Region_DataIDNumber], Led_Control_ID, 3) == 0)
    {
        //Led_Control_Process(p_source[Region_DataValNumber], p_device);
        //p[Region_DataLenNumber] = 0;
        //reply_flag = 1;
    }

    else if (memcmp(&p_source[Region_DataIDNumber], SecretKey_ID, 3) == 0)
    { //获得密文后重新初始化了无线
//			ask = SecretKey_Process(&p_source[Region_DataValNumber]);

//        if (ask == 0)
//        {
//            p[Region_DataLenNumber] = 0;
//        }
//        else if (ask == 1)
//        {
//            p_source[Region_CmdNumber] |= 0x40;
//            p[Region_DataLenNumber] = 1;
//            p[Region_DataAFNNumber] = Format_Error;
//        }
//        else
//        {
//            p_source[Region_CmdNumber] |= 0x40;
//            p[Region_DataLenNumber] = 1;
//            p[Region_DataAFNNumber] = FrameFunction_Exist;
//        }
//        reply_flag = 1;
    }


    else if (memcmp(&p_source[Region_DataIDNumber], Provide_LogicAddrTab_Id, 3) == 0)
    {
        p[Region_DataLenNumber] = 0;
        reply_flag = 1;
    }

    else if (memcmp(&p_source[Region_DataIDNumber], GetVersion_ID, 3) == 0)
    {
        //GetVersion_Process(p_source, &Rout_TryBuf);
//        memmove(&p[Region_DataAFNNumber], &p_source[Region_DataAFNNumber], 4);
//        p[Region_DataValNumber] = Version_Number >> 8;
//        p[Region_DataValNumber + 1] = Version_Number & 0xff;
//        p[Region_DataLenNumber] = 6;

//        reply_flag = 1;
    }

    else if (memcmp(&p_source[Region_DataIDNumber], TimeCalib_ID, 3) == 0)
    {
        //__disable_interrupt();
        RunningTime_Buf.year = ((p[Region_DataValNumber] >> 4) & 0x0f) * 10 + (p[Region_DataValNumber] & 0x0f);
        RunningTime_Buf.month = ((p[Region_DataValNumber + 1] >> 4) & 0x01) * 10 + (p[Region_DataValNumber + 1] & 0x0f);
        RunningTime_Buf.date = ((p[Region_DataValNumber + 2] >> 4) & 0x03) * 10 + (p[Region_DataValNumber + 2] & 0x0f);
        RunningTime_Buf.hour = ((p[Region_DataValNumber + 3] >> 4) & 0x03) * 10 + (p[Region_DataValNumber + 3] & 0x0f);
        RunningTime_Buf.minute = ((p[Region_DataValNumber + 4] >> 4) & 0x07) * 10 + (p[Region_DataValNumber + 4] & 0x0f);
        RunningTime_Buf.second = ((p[Region_DataValNumber + 5] >> 4) & 0x07) * 10 + (p[Region_DataValNumber + 5] & 0x0f);
        //__enable_interrupt();

        p[Region_DataLenNumber] = 0;

        reply_flag = 1;
    }

    else if (memcmp(&p_source[Region_DataIDNumber], MACRead_ID, 3) == 0)
    {
        uint8_t Rel = MACRead_Process(p); //读取MAC地址帧的处理

        if (!Rel)
        {
            p_source[Region_CmdNumber] |= 0x40;
            p[Region_DataLenNumber] = 5;
            p[Region_DataValNumber] = Data_Error;
        }
        memmove(&p[Region_DataAFNNumber], &p_source[Region_DataAFNNumber], 4);

        reply_flag = 1;
    }

    if (reply_flag)
    {
        if (!ask)
            memmove(&p[Region_AddrNumber], Self_LogicAddr, LogicAddr_Len);
        else
            memmove(&p[Region_AddrNumber], &p_source[Region_AddrNumber], LogicAddr_Len); //按照下行的地址信息上报
        p[Region_SeqNumber] = p_source[Region_SeqNumber];                                //
        p[Region_CmdNumber] = p_source[Region_CmdNumber] | 0x80;                         //
        send_len = Frame_Compose(p);                                                     //
        UpUart_DataTx(p, send_len, &UpCom_TxBuf);                                        //
    }
}

void Clear_EventFrame_Process(uint8_t *p_source, HKFrame_TypDef *p_framebuf)
{
    uint8_t i;
    Retry_TypDef *p_retry;

    for (i = 0; i < Retry_Buf_Size; i++)
    {
        p_retry = &p_framebuf->Retry_Buf[i];
        if (p_retry->RetryCnt)
        {
            if ((p_retry->Retry_DataBuf[Region_SeqNumber] & 0x0f) == (p_source[Region_SeqNumber] & 0x0f))
            {
                if (memcmp(&p_retry->Retry_DataBuf[Region_AddrNumber], &p_source[Region_AddrNumber], 4) == 0)
                {
                    p_retry->RetryCnt = 0;
                    p_framebuf->RetryBuf_Space &= ~(1 << p_retry->RetryBuf_Number);
                    return;
                }
            }
        }
    }
}

