742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/xiao ai/frame_process.c
void RemoteUp_CmdFrame_Process(uint8_t *p_source, uint8_t len, uint8_t *p_buf)
{
    uint8_t send_len, transpond_flag = 0; //
    uint8_t frame_cmd = p_source[Region_CmdNumber];
    uint8_t WakeUp_Cnt = 20;
    uint8_t WakeUp_Data[3] = {0XAB, 0XCD, 0XEF};

    p_source[Region_SeqNumber] &= 0x7f;

    if (memcmp(&p_source[Region_DataIDNumber], Set_LogicAddr_Id, 3) == 0) //如为组网帧
    {
        if ((memcmp(&p_source[Region_AddrNumber + 1], LANGroup_Addr, 3) != 0) || 
		(memcmp(&p_source[Region_DataValNumber + MAC_Data_Len], &aes_out[RsaByte_Size * 2], RsaByte_Size) != 0)) //如群组地址或密文不一样
        {
            frame_cmd |= 0x40;
            p_buf[Region_DataLenNumber] = 1;
            p_buf[Region_DataAFNNumber] = Parameter_Error;
            transpond_flag = 0;
        }
        else
        {
            p_buf[Region_DataLenNumber] = 0;
            transpond_flag = 1;
        }
    }
    else //通讯帧
    {
        if (memcmp(&p_source[Region_AddrNumber + 1], LANGroup_Addr, 3) != 0) //群组地址不一样
        {
            frame_cmd |= 0x40;
            p_buf[Region_DataLenNumber] = 1;
            //p_buf[Region_DataAFNNumber] = LANG_Addr_Error;
            p_buf[Region_DataAFNNumber] = Data_Error;
            transpond_flag = 0;
        }
        else if ((p_source[Region_SeqNumber] & 0x60) && (Secret_KeyOk_Flag == 0)) //如为加密帧但密钥未ok
        {
            frame_cmd |= 0x40;
            p_buf[Region_DataLenNumber] = 1;
            p_buf[Region_DataAFNNumber] = Key_NotReady;
            transpond_flag = 0;
        }
        else
        {
            p_buf[Region_DataLenNumber] = 0;
            transpond_flag = 1;
        }
    }

    if (transpond_flag) //需要转发就转发出去
    {
        if (p_source[Region_SeqNumber] & 0x60) //
        {
            send_len = Encrypt_Convert(p_source, len, 0); //加密
        }
        else
        {
            send_len = len;
        }


        if (memcmp(&p_source[Region_DataIDNumber], Set_LogicAddr_Id, 3) == 0) //组网帧用了默认频道
        {
#ifdef Use_Rout
            Frame_WaitOver_Time = 75 + Network_Delay; //8秒
#endif

            if ((p_source[Region_CmdNumber] & 0x07) == 2) //要唤醒的方式通信
            {
                Si4438_Receive_Start(Default_Channel); //听信道
                SysDelay_Xms(20);
                while (WakeUp_Cnt)
                {
                    WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Default_Channel, WakeUp_Data, 3);
                    WakeUp_Cnt--;
                    SysDelay_Xms(25);
                    //IWDG_FEED();
                }
            }

			WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Default_Channel, p_source, send_len);
        }
        else //非组网帧
        {
#ifdef Use_Rout
            Frame_WaitOver_Time = 75;
#endif

            if ((p_source[Region_CmdNumber] & 0x07) == 2) //要唤醒的方式通信
            {
                Si4438_Receive_Start(Wireless_Channel[0]); //听信道
                SysDelay_Xms(20);
                while (WakeUp_Cnt)
                {
                    WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Wireless_Channel[0], WakeUp_Data, 3);
                    WakeUp_Cnt--;
                    SysDelay_Xms(25);
                    //IWDG_FEED();
                }
            }
            WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Wireless_Channel[0], p_source, send_len);
        }
    }
    if (transpond_flag)
        memmove(&p_buf[Region_AddrNumber], Self_LogicAddr, 4);
    else
        //按照下行的地址信息上报，经处理发现帧有误
        memmove(&p_buf[Region_AddrNumber], &p_source[Region_AddrNumber], 4); //

    p_buf[Region_SeqNumber] = p_source[Region_SeqNumber]; //
    p_buf[Region_CmdNumber] = frame_cmd | 0x80;           //
    send_len = Frame_Compose(p_buf);                      //
    UpUart_DataTx(p_buf, send_len, &UpCom_TxBuf);         //
}

void RemoteDown_CmdFrame_Process(uint8_t *p_source, uint8_t len)
{
    uint8_t send_len;

    if (memcmp(&p_source[Region_AddrNumber + 1], LANGroup_Addr, 3) != 0)
        return; //群组地址不一样，返回

#ifdef Use_Rout
    Frame_Wait_Cnt = 0;
#endif
    if (p_source[Region_SeqNumber] & 0x60)
    {
        if (!Secret_KeyOk_Flag)
            return;
        send_len = Encrypt_Convert(p_source, len, 1); //做解密给上位机
    }
    else
    {
        send_len = Frame_Compose(p_source);
    }

#ifdef Use_Rout
    if (p_source[Region_SeqNumber] & 0x80)
    {
        //RoutPath_Read(p_source[Region_AddrNumber]);
        RoutPath_Save(&Rout_TempTab, &p_source[Region_DataAFNNumber + p_source[Region_DataLenNumber]], p_source[Region_AddrNumber]); //保存路由表
        send_len = Frame_RoutRegion_Delete(p_source);
    }
#endif
    UpUart_DataTx(p_source, send_len, &UpCom_TxBuf);
}

void RemoteDown_EventFrame_Process(uint8_t *p_source, uint8_t len, HKFrame_TypDef *p_framebuf)
{
#ifdef Use_Rout
    uint8_t rout_region[3 + RoutSeries_Size];
#endif

    uint8_t send_len;
    uint8_t *p_buf = p_framebuf->FrameProcess_Buf;

    if (memcmp(&p_source[Region_AddrNumber + 1], LANGroup_Addr, 3) != 0)
        return; //群组地址不一样，返回

    if (p_framebuf->RetryBuf_Space == 0Xff)
        return;

    if (p_source[Region_SeqNumber] & 0x60)
    {
        if (!Secret_KeyOk_Flag)
            return;
        send_len = Encrypt_Convert(p_source, len, 1); //解密
    }
    else
        send_len = len;
        ///////////////////////////////////////////////////////
#ifdef Use_Rout
    if (p_source[Region_SeqNumber] & 0x80)
    {
        //memmove(rout_region, &p_source[len - (3 +(3+RoutSeries_Size))], 3+RoutSeries_Size);
        memmove(rout_region, &p_source[Region_DataAFNNumber + p_source[Region_DataLenNumber]], 3 + RoutSeries_Size);
        //RoutPath_Read(p_source[Region_AddrNumber]);
        RoutPath_Save(&Rout_TempTab, rout_region, p_source[Region_AddrNumber]);
        send_len = Frame_RoutRegion_Delete(p_source);
    }
#endif
    send_len = Frame_Compose(p_source);
    //////////////////////////////////////////////////
    //Retry_Start(p_framebuf, p_source, send_len);
    UpUart_DataTx(p_source, send_len, &UpCom_TxBuf);

    memmove(&p_buf[Region_AddrNumber], &p_source[Region_AddrNumber], LogicAddr_Len);
    p_buf[Region_SeqNumber] = p_source[Region_SeqNumber];
    p_buf[Region_CmdNumber] = p_source[Region_CmdNumber] & 0x7f; //cmd为0X18
    p_buf[Region_DataLenNumber] = 0;
    send_len = Frame_Compose(p_buf);

    if (p_buf[Region_SeqNumber] & 0x60)
    {
        if (Secret_KeyOk_Flag)
        {
            send_len = Encrypt_Convert(p_buf, send_len, 0); //加密
#ifdef Use_Rout
            if (p_source[Region_SeqNumber] & 0x80)
            {
                send_len = Frame_RoutRegion_Add(p_buf, send_len, rout_region);
            }
#endif
            WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Wireless_Channel[0], p_buf, send_len);
        }
    }
    else
    {
#ifdef Use_Rout
        if (p_source[Region_SeqNumber] & 0x80)
        {
            send_len = Frame_RoutRegion_Add(p_buf, send_len, rout_region);
        }
#endif
        WIRELESS_ERROR_CODE = Si4438_Transmit_Start(&Wireless_Buf, Wireless_Channel[0], p_buf, send_len);
    }
}

//對幀控制碼各命令的處理           事件帧：受用户干预产生的通讯帧
void Frame_Process(uint8_t *p_source, uint8_t len, HKFrame_TypDef *p_framebuf, DevicePara_TypDef *p_device)
{
    uint8_t frame_type = p_source[Region_CmdNumber] & 0x98;

    switch (frame_type)
    {
//    case Local_CmdFrame:
//        Local_CmdFrame_Process(p_source, p_framebuf, p_device);
//        break;

//    case Local_EventFrame:
//        Clear_EventFrame_Process(p_source, p_framebuf);
//        break;

