742117806/AI_Board_STM32F103C8T6/AI_扩展板MCU固件程序/STM32F103C8T6_FreeROTS/xiao ai/frame_process.c
//    case RemoteUp_CmdFrame:
//        RemoteUp_CmdFrame_Process(p_source, len, p_framebuf->FrameProcess_Buf);
//        break;

//    case RemoteUp_EventFrame: //主机要求不重发了，清标志
//        Clear_EventFrame_Process(p_source, p_framebuf);
//        break;

//    case RemoteDown_CmdFrame:
//        RemoteDown_CmdFrame_Process(p_source, len);
//        break;

//    case RemoteDown_EventFrame:
//        RemoteDown_EventFrame_Process(p_source, len, p_framebuf);
//        break;

    default:
        break;
    }
}

void UpReport_Start(HKFrame_TypDef *p_framebuf)
{
    uint8_t *p = p_framebuf->FrameProcess_Buf;
    uint8_t send_len;

    if (++p_framebuf->Upreport_FrameSeq > 15)
        p_framebuf->Upreport_FrameSeq = 0;
#if (Devece_Attrs)
    memmove(&p[Region_AddrNumber], Self_LogicAddr, LogicAddr_Len);
    p[Region_SeqNumber] = p_framebuf->Upreport_FrameSeq;
    p[Region_CmdNumber] = Local_UpReportCmd;
#else
    memmove(&p[Region_AddrNumber], Self_LogicAddr, LogicAddr_Len);
    p[Region_SeqNumber] = p_framebuf->Upreport_FrameSeq | 0x20;
    p[Region_CmdNumber] = Remote_UpReportCmd;
#endif

    send_len = Frame_Compose(p);

#if (Devece_Attrs)
    UpUart_DataTx(p, send_len, &UpCom_TxBuf);
#else

#endif
}


//电器端使用（重试函数）
void Retransmission_Process(HKFrame_TypDef *p_framebuf)
{
    uint8_t i;
    Retry_TypDef *p_retry;

    if (UpCom_TxBuf.Tx_Status != UartTx_Finished)
        return;
    for (i = 0; i < Retry_Buf_Size; i++)
    {
        p_retry = &p_framebuf->Retry_Buf[i];

        if (p_retry->RetryCnt > 0)
        {
            if (SYSTICK_CNT - p_retry->Retry_StartTime > Frame_RetryTimes)
            {
                UpUart_DataTx(p_retry->Retry_DataBuf, p_retry->Retry_SendLen, &UpCom_TxBuf);
                if (p_retry->RetryCnt)
                    p_retry->RetryCnt--;
                if (p_retry->RetryCnt > 0)
                {
                    //rim();
                    p_retry->Retry_StartTime = SYSTICK_CNT;
                    //sim();
                }
                else
                {
                    p_framebuf->RetryBuf_Space &= ~(1 << p_retry->RetryBuf_Number);
                }
                break;
            }
        }
    }
}

void SysTick_Handle(void)
{
    static uint16_t time_cnt;

    if ((SYSTICK_CNT & 0x07) == 0)
    {
        TICK_8ms = 1;
    }

    if (++time_cnt >= 1000) //1秒
    {
        time_cnt = 0;
        if (++RunningTime_Buf.second >= 60)
        {
            RunningTime_Buf.second = 0;
            if (++RunningTime_Buf.minute >= 60)
            {
                RunningTime_Buf.minute = 0;
                if (++RunningTime_Buf.hour >= 24)
                {
                    uint8_t date_size;

                    RunningTime_Buf.hour = 0;
                    switch (RunningTime_Buf.month)
                    {
                    case 1:
                    case 3:
                    case 5:
                    case 7:
                    case 8:
                    case 10:
                    case 12:
                        date_size = 31;
                        break;

                    case 4:
                    case 6:
                    case 9:
                    case 11:
                        date_size = 30;
                        break;

                    case 2:
                        if ((RunningTime_Buf.year & 0x03) == 0)
                            date_size = 29;
                        else
                            date_size = 28;
                        break;

                    default:
                        break;
                    }
                    if (++RunningTime_Buf.date > date_size)
                    {
                        RunningTime_Buf.date = 1;
                        if (++RunningTime_Buf.month > 12)
                        {
                            RunningTime_Buf.month = 1;
                            if (++RunningTime_Buf.year >= 100)
                                RunningTime_Buf.year = 0;
                        }
                    }
                }
            }
        }
    }
}
